{
  
  "_": {
    "LANG": "en",
    "NAME": "Loaded language: English"
  },

  "INTERFACE": {

  },

  "INTRO": [
    "Welcome to MonumentalMountain Alpha v0.03 created by ~jtech-labs",
    "Legends have been told about the Mysterious Monumental Mountain, a realm accessible only while in a certain mental state that must me reached through sleep.",
    "A place created at the dawn of humankind by the Supreme Planetary Council of Intelligence to test all humans until they are advanced enough as a species to join the Supreme Council",
    "You, a simple human who has only read about this mysterious real in medieval history books, go to bed in peace without the knowledge that at exactly midnight of the summer equinox of 2025, everyone ond the dark and light side of the Earth unconsciously decide to sleep all at the same time.",
    "Only the human who is most consciously unprepared but subconsciously ready would be chosen to go and stand fo their species.",
    "And that one specific person, at this one specific moment happens to be...\n",
    "You",
        
    "Welcome to the Monumental Mountain. We will lead you though the terrain, but you must make the vital decisions as you progress. If you ever need help, type in `Help`\n",
    "!!WARNING!!, THIS GAME IS INPIRED BY COLOSSAL CAVE ADVENTURE, AND AS SO, YOUR PROGRESS WILL **NOT** BE SAVED, YOU HAVE BEEN WARNED",
    "The available prompts will be directions (e.g. forewards, back, right, left) and several more, if you need help, just type in `Help`.",
    "Are you ready, <yes> or <no>?:\n>",

    ["yes", "YES", "y", "no", "no", "n"],

    ["Starting . . . . . . . . . . . . . . . . . . .",
    "You have decided that you are not yet ready for this. The council will chose someone else to replace you. Remember though, you can always come back whenever you wish..."],
         
    "You're lost and scared, out of control. You are trapped in a nightmare where you can't stop falling. Incomprehensible lights, colors and emotions fly past you at impossible speeds while reality and imagination merge into a flash of white that overwhelms you as you collide with the ground.",
    "You don't remember anything, not even your name or age. All you know is that you are at the edge of a crossroads and that something is forcing you to move forwards",
    "After some consideration, you decide to refer to yourself as:\n>",
    ["Now, ", ", the first thing you do is notice a cuff bracelet made from gold and copper with incrusted gems that contains a lot of wierd and fascinating engraved text in some kind of foreign language not known to you or your kind."],
    "You discover that it cannot be taken off and decide not to worry about it too much and focus on wht is directly in front of you.\n"

  ],

  "STORY": {
    
    "map": {
        "Superliminal Space": {"Forwards": "Mountain Base", "Right": "Forrest Start", "Left": "Desert Start", "Down": "Tilled Land", "msgs": 3, "Item": ["BreadLoaf"]}, 
        "Mountain Base" : {"Backwards": "Superliminal Space", "Item": ["WhackyPotion"], "msgs": 7},
        "Forrest Start": {"Backwards": "Superliminal Space", "Item": ["Wand"], "msgs": 5},
        "Desert Start": {"Forwards": "Desert Canyon", "Right": "Desert Shadow", "Left": "Desert Rocks", "Backwards": "Superliminal Space", "Item": ["BreadLoaf"]},
        "Tilled Land": {"Item": ["Compass"]},
        "Desert Shadow": {"Backwards": "Desert Start", "Item": ["Coin"]},
        "Desert Rocks": {"Backwards": "Desert Start", "Item": [""]},
        "Desert Canyon": {"Boss": "Cocroach", "Backwards": "Desert Start", "Item": ["Sand"], "Forwards": "Further Desert Canyon"},
        "Further Desert Canyon": {"Backwards": "Desert Canyon", "Req": "SpecialTorch"}
    },
    
    "story": {
      
      "Superliminal Space": "You look forwards, at the crossroads, a slightly superliminal place. A path directly ahead of you leads to a giant grey, snow-capped mountain shrouded by clouds which half hides the bright sun. To the right there is a path leading to a green and life-filled forest. The treetops are shrouded by storm clouds and a dark atmosphere emanates from it. The left path leads to a barren and arid desert with a few littered canyons and scorching heat that can be felt even from here.",

      "Forrest Start": "You decide that this is the best option for food and that it will be easier to survive.",

      "Mountain Base": "You are filled with a burning curiosity and decide to make headway for the mountain.",

      "Desert Start": "Even though you might not find water there you think it is the best option for refuge. You slowly stroll forwards, brushing the sand with your feet as the sun scorches the back of your neck. You see a set of large rocks to the left that look like could be good for refuge and might be a bit humid. You can also see a small shadow far off to the right and think it could be an oasis. Or you could carry on forwards just incase you find anything better.",

      "Desert Shadow": "After some walking, you find a palm tree with an \"X\" carved into it, as this had always meant treasure in your world, you dig a few centimeters and find a small coin, when you go to touch it, a surge of power ruches through you as you feel an increase of energy traveling through you body. Now you can only go backwards.",

      "Desert Rocks": "You find a few boulders grouped seemingly randomly around a larger center boulder where a line of text written in the same language as on your cuff bracelet an ark",

      "Desert Canyon": "You slowly go down to the canyon to see what's there. As you preceed, you see the great expanse of the land, with the yellow sand that expands to the horizon.",

      "Tilled Land": "You decided that you don't want to go in the traditional directions presented to you, and you decide to start digging downwards. You appear into a secret network of tunnels underneath the map that no oe knew existed."

    },

    "compass": {

      "Superliminal Space": "This is a superliminal place. Superliminal is a term used in psychology and physiology to describe mental activity that is above the threshold of the subconscious. It is the opposite of subliminal, which refers to mental activity that is below the threshold of conscious awareness. The term supraliminal is also used to describe mental activity that is above the threshold of consciousness."

    },

    "Interact": {

      "Talk": {

        "Cocroach": [

          "Even though you find this unknown animal very frightening, you decide to gently hush in order to calm it down. The cockroach looks at you with confusion. To your surprise it responds and says 'What are you doing? I am the guardian of the Isoriac dessert. My unlucky body normally frightens most people but I'm actually very friendly!' You discover that its name in Inorilarn, the long forgoten language of this land, and that it has been here since the first ray of light dried the sandy place. He hasn't talked to anyone in a lot of time as most adventurers are too terrified. The Cocroach gifts you a few presents, thanking you from seeing th beauty in him, and dissapears to protect another land...",

          "The Cocroach isn't here anymore"
          ]
      
      },

      "Read": {

        "Basicsignpost": "Hi!"

      },

      "Fight": {
        
        "Cocroach": {
          
          "The cocroach stands on it's hind legs, it looks very intimidating.",

          "TODO: continue"

        }

      }

    }

  }

} 
